Repository: for-nobody/input-flow
Catalog: apps/settings-winui/InputFlow.Settings/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# LanguageTag
source: en-US
zh_cn: zh-CN

# Window_Title
source: InputFlow Settings
zh_cn: InputFlow 设置

# MainWindow.Title
source: InputFlow Settings
zh_cn: InputFlow 设置

# AppTitleBar.Title
source: InputFlow Settings
zh_cn: InputFlow 设置

# MainPage.Language
source: en-US
zh_cn: zh-CN

# KeyPicker.Language
source: en-US
zh_cn: zh-CN

# LocalizationProbeText.Text
source: Localization ready
zh_cn: 本地化已就绪

# LocalizationProbeButton.Content
source: OK
zh_cn: 确定

source: Localization smoke button
zh_cn: 本地化冒烟测试按钮

# RootNavigation.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: InputFlow Settings navigation
zh_cn: InputFlow 设置导航

# RootNavigation.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.HelpText
source: Navigate between rules, settings, and about.
zh_cn: 在规则、设置和关于页面之间切换。

# RulesNavigation.Content
source: Rules
zh_cn: 快捷规则

# SettingsNavigation.Content
source: Settings
zh_cn: 设置

# AboutNavigation.Content
source: About
zh_cn: 关于

# ConnectionBar.Title
source: Connecting
zh_cn: 正在连接

# RetryConnectionButton.Content
source: Retry
zh_cn: 重试

source: Retry Agent connection
zh_cn: 重试 Agent 连接

# CaptureBar.Title
source: Capturing input
zh_cn: 正在录制输入

# CancelCaptureButton.Content
source: Cancel (Esc)
zh_cn: 取消 (Esc)

source: Cancel input capture
zh_cn: 取消输入录制

# RulesPageTitle.Text
source: Rules
zh_cn: 快捷规则

# RulesPageDescription.Text
source: Create keyboard and mouse triggers with key-chord actions. Changes remain in a local draft until saved.
zh_cn: 创建键盘和鼠标触发条件及键盘组合动作；修改在保存前只进入本地草稿。

# DirtyText.Text
source: Unsaved changes
zh_cn: 有未保存更改

# AddRuleButton.Label
source: New
zh_cn: 新建

# AddRuleButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Create a new rule
zh_cn: 新建规则

# SaveButton.Label
source: Validate and save
zh_cn: 验证并保存

# SaveButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Validate and save the draft
zh_cn: 验证并保存草稿

# ReloadButton.Label
source: Reload
zh_cn: 重新加载

# ReloadButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Reload the formal configuration
zh_cn: 重新加载正式配置

# PauseButton.Label
source: Pause
zh_cn: 暂停

# PauseButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Pause Agent
zh_cn: 暂停 Agent

# GroupFilter.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Filter rules by first key
zh_cn: 按首键筛选规则

# RulesList.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Rule list
zh_cn: 规则列表

# RuleRowEditButton.Content
source: Edit
zh_cn: 编辑

# RuleRowDeleteButton.Content
source: Delete
zh_cn: 删除

# EmptyRulesText.Text
source: No rules in this group. Select New to begin.
zh_cn: 当前分组没有规则。选择“新建”开始。

# EditorTitle.Text
source: Edit rule
zh_cn: 编辑规则

# RuleIdBox.Header
source: Rule ID
zh_cn: 规则 ID

# RuleIdBox.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Rule ID
zh_cn: 规则 ID

# EditorEnabled.Header
source: Enable rule
zh_cn: 启用规则

# EditorEnabled.OnContent
source: Enabled
zh_cn: 启用

# EditorEnabled.OffContent
source: Disabled
zh_cn: 禁用

# EditorEnabled.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Rule enabled state
zh_cn: 规则启用状态

# TriggerTypeCombo.Header
source: Trigger
zh_cn: 触发条件

# TriggerTypeCombo.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Trigger type
zh_cn: 触发条件类型

# TriggerKeyChord.Content
source: Key + key
zh_cn: 键 + 键

# TriggerKeyMouseButton.Content
source: Key + mouse button
zh_cn: 键 + 鼠标按钮

# TriggerHold.Content
source: Hold keyboard key
zh_cn: 长按键盘键

# TriggerHoldMouseButton.Content
source: Hold keyboard key + mouse button
zh_cn: 长按键盘键 + 鼠标按钮

# TriggerMouseDirection.Content
source: Hold keyboard key + mouse direction
zh_cn: 按住键盘键 + 鼠标方向

# PrimaryKeyLabel.Text
source: First key
zh_cn: 第一个键

# SecondaryKeyLabel.Text
source: Second key
zh_cn: 第二个键

# TimeoutBox.Header
source: Keyboard hold threshold (milliseconds)
zh_cn: 键盘键长按阈值（毫秒）

# TimeoutBox.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Keyboard hold threshold in milliseconds
zh_cn: 键盘键长按毫秒数

# MouseButtonLabel.Text
source: Mouse button pressed afterward
zh_cn: 随后按下的鼠标按钮

# MouseButtonCombo.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Mouse button
zh_cn: 鼠标按钮

# RecordMouseButtonButton.Content
source: Capture
zh_cn: 录制

source: Capture a mouse button
zh_cn: 录制鼠标按钮

# DirectionParametersLabel.Text
source: Mouse direction parameters
zh_cn: 鼠标方向参数

# DirectionCombo.Header
source: Direction
zh_cn: 方向

# DirectionCombo.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Mouse movement direction
zh_cn: 鼠标移动方向

# DirectionDistanceBox.Header
source: Minimum net displacement (screen pixels)
zh_cn: 最小净位移（屏幕像素）

source: Minimum mouse direction distance in pixels
zh_cn: 鼠标方向最小距离像素

# DirectionDurationBox.Header
source: Maximum time window (milliseconds)
zh_cn: 最大时间窗（毫秒）

source: Maximum mouse direction time in milliseconds
zh_cn: 鼠标方向最大时间毫秒

# DirectionToleranceBox.Header
source: Off-axis tolerance (screen pixels)
zh_cn: 偏轴容差（屏幕像素）

source: Mouse direction off-axis tolerance in pixels
zh_cn: 鼠标方向偏轴容差像素

# DirectionHelpText.Text
source: Hold the activation key and move. The pointer always moves normally. Each hold can trigger once and rearms after release. Four directions using the same activation key must share these parameters.
zh_cn: 按住上方激活键后移动；光标始终正常移动，每次按住最多触发一次，松开后重新武装。同一激活键的四方向规则必须使用相同参数。

# StartDirectionPreviewButton.Content
source: Start limited preview
zh_cn: 开始有限预览

source: Start mouse direction preview
zh_cn: 开始鼠标方向预览

# CancelDirectionPreviewButton.Content
source: Cancel preview
zh_cn: 取消预览

source: Cancel mouse direction preview
zh_cn: 取消鼠标方向预览

source: Mouse direction preview progress
zh_cn: 鼠标方向预览进度

# DirectionPreviewText.Text
source: The preview does not save pointer paths or run actions. Starting it acts as a temporary activation.
zh_cn: 预览不保存轨迹，也不执行动作；点击开始相当于临时激活。

# ActionKeysLabel.Text
source: Action: key chord
zh_cn: 动作：键盘组合

# AddActionKeyButton.Content
source: Add action key
zh_cn: 增加动作键

# AddActionKeyButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Add an action key
zh_cn: 增加动作键

# ActionKeysHelpText.Text
source: Copy and paste can be represented as Ctrl+C and Ctrl+V. There is no dedicated clipboard action.
zh_cn: 复制/粘贴可分别表达为 Ctrl+C / Ctrl+V。当前没有专用剪贴板动作。

# CancelEditButton.Content
source: Cancel edit
zh_cn: 取消编辑

# CommitEditButton.Content
source: Write to draft
zh_cn: 写入草稿

# SettingsPageTitle.Text
source: Settings and diagnostics
zh_cn: 设置与诊断

# LanguageSectionTitle.Text
source: Display language
zh_cn: 显示语言

# LanguageSectionDescription.Text
source: Choose the language for Settings. Reopen Settings to apply the change; the Agent keeps running.
zh_cn: 选择 Settings 的显示语言。关闭并重新打开 Settings 后生效；Agent 会继续运行。

# LanguageCombo.Header
source: Settings language
zh_cn: 设置界面语言

# LanguageCombo.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Settings display language
zh_cn: 设置界面显示语言

# LanguageCombo.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.HelpText
source: Select system matching, English, or Simplified Chinese. Reopen Settings to apply.
zh_cn: 选择跟随系统、英语或简体中文。重新打开 Settings 后生效。

source: System default; follow Windows display language
zh_cn: 跟随 Windows 系统显示语言

source: English
zh_cn: 英语

source: Simplified Chinese
zh_cn: 简体中文

# LanguageRestartBar.Title
source: Reopen Settings to apply
zh_cn: 重新打开 Settings 后生效

# EmergencySectionTitle.Text
source: Emergency bypass key
zh_cn: 紧急旁路键

# EmergencySectionDescription.Text
source: The emergency key must use logical identity and cannot be the first key of an enabled rule. The Agent performs the final conflict check.
zh_cn: 紧急键必须是 logical，并且不能作为启用规则的首键。最终冲突由 Agent 校验。

# SetEmergencyKeyButton.Content
source: Write to draft
zh_cn: 写入草稿

# AgentStatusSectionTitle.Text
source: Agent status
zh_cn: Agent 状态

# AgentStatusText.Text
source: Not connected
zh_cn: 未连接

# PauseResumeButton.Content
source: Pause / Resume
zh_cn: 暂停 / 恢复

# RetryConnectionSettingsButton.Content
source: Retry connection
zh_cn: 重试连接

# DiagnosticsSectionTitle.Text
source: Diagnostics
zh_cn: 诊断

# DiagnosticsSectionDescription.Text
source: Statistics are queried only when you select Refresh; this page does not poll every second.
zh_cn: 统计只在点击刷新时查询；页面不会每秒轮询。

# RefreshStatsButton.Content
source: Refresh diagnostics
zh_cn: 刷新诊断

# StatsText.Text
source: Not queried
zh_cn: 尚未查询

# RecoveryBoundaryInfo.Title
source: Configuration recovery boundary
zh_cn: 配置恢复边界

# RecoveryBoundaryInfo.Message
source: The current protocol has no configuration recovery API. If recovery_required appears, restart the Agent and reload the formal configuration; this page will not claim recovery succeeded.
zh_cn: 当前协议没有配置恢复 API。若显示 recovery_required，请重启 Agent 并重新读取正式配置；此页面不会假装恢复成功。

# AboutPageTitle.Text
source: About InputFlow
zh_cn: 关于 InputFlow

# AboutScopeText.Text
source: Supported triggers: key_chord, key_mouse_button, hold, hold_mouse_button, and mouse_direction; supported action: key_chord. Each capture observes one key or mouse button.
zh_cn: 支持范围：key_chord、key_mouse_button、hold、hold_mouse_button、mouse_direction 触发器，以及 key_chord 动作。录制一次只观察一个键或鼠标按钮。

# AboutDistributionText.Text
source: The v0.9.0 x64 portable package is unpackaged and carries self-contained .NET and Windows App SDK components. Microsoft Visual C++ Redistributable 2015–2022 x64 is still required. Closing this window does not stop the Rust Agent, hooks, or tray icon.
zh_cn: v0.9.0 x64 便携包采用 unpackaged + 双 self-contained，随包携带 .NET 与 Windows App SDK；系统仍需 Microsoft Visual C++ Redistributable 2015–2022 x64。关闭此窗口不会停止 Rust Agent、Hook 或托盘。

# AboutLicenseText.Text
source: The project uses the MIT License. Project and third-party license files are included with the distribution. Sign-in autostart is disabled by default and can be managed with the included enable, status, and disable scripts.
zh_cn: 项目采用 MIT 许可证；项目许可证和第三方许可文件随发布包提供。登录自启动默认关闭，可由包内 enable、status 和 disable 脚本管理。

# AboutLimitationsText.Text
source: Not supported: Fn, arbitrary three-key chords, per-application rules, opening programs/folders/web pages, or sign-in startup and system accessibility switches inside Settings.
zh_cn: 尚不支持：Fn、任意三键、按应用生效、打开程序/文件夹/网页，以及设置页内的登录启动和系统辅助功能开关。

# LogicalKeyCombo.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Logical key
zh_cn: 逻辑键

source: Select the stable logical key identity.
zh_cn: 选择稳定的 logical 键身份。

# KeyCaptureButton.Content
source: Capture
zh_cn: 录制

# KeyCaptureButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Capture this key
zh_cn: 录制这个键

# AdvancedKeyIdentityExpander.Header
source: Advanced key identity
zh_cn: 高级键身份

# PhysicalMode.Header
source: Match physical position
zh_cn: 按物理位置匹配

# PhysicalMode.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Use physical scan code
zh_cn: 使用物理扫描码

# ScanCodeBox.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Scan code
zh_cn: 扫描码

# ExtendedCheck.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Extended key flag
zh_cn: 扩展键标志

# PhysicalModeHelpText.Text
source: Physical mode follows key position and requires a nonzero scan code. Display text is not written to the configuration.
zh_cn: 物理模式跟随键盘位置；仅在非零 scan code 时可用。显示文字不会写入配置。

# CloseDialog_Title
source: Unsaved draft
zh_cn: 有未保存的草稿

# CloseDialog_Message
source: The current rule edit or draft exists only in Settings memory and has not been saved by the Agent. Save successfully before exiting, or explicitly discard the changes.
zh_cn: 当前规则编辑或草稿只存在于设置程序内存中，尚未由 Agent 保存。保存成功后退出，或明确放弃这些更改。

# CloseDialog_SaveAndExit
source: Save and exit
zh_cn: 保存并退出

# CloseDialog_ExitWithoutSaving
source: Exit without saving
zh_cn: 不保存退出

# Common_Back
source: Back
zh_cn: 返回

# Common_Cancel
source: Cancel
zh_cn: 取消

# Common_Delete
source: Delete
zh_cn: 删除

# Common_Reload
source: Reload
zh_cn: 重新加载

# Common_Remove
source: Remove
zh_cn: 移除

# Common_Pause
source: Pause
zh_cn: 暂停

# Common_Resume
source: Resume
zh_cn: 恢复

# Common_NotConnected
source: not connected
zh_cn: 未连接

# RuleEditor_CannotCommit
source: The current rule edit cannot be written to the draft.
zh_cn: 当前规则编辑无法写入草稿。

# RuleEditor_NewTitle
source: New rule
zh_cn: 新建规则

# RuleEditor_EditTitle
source: Edit rule
zh_cn: 编辑规则

# RuleEditor_HoldMouseHelp
source: The keyboard key is timed. Press the mouse button after the threshold; the mouse button itself does not need to be held.
zh_cn: 计时对象是上方的键盘键；达到阈值后再按鼠标按钮。鼠标按钮本身不需要长按。

# RuleEditor_HoldHelp
source: The keyboard key is timed. The action runs after the threshold.
zh_cn: 计时对象是上方的键盘键；达到阈值后触发动作。

# RuleEditor_Incomplete
source: Some rule fields are incomplete.
zh_cn: 规则字段不完整。

# RuleEditor_ErrorTitle
source: Check the rule fields
zh_cn: 规则字段有问题

# Connection_NotConnectedTitle
source: Agent not connected
zh_cn: Agent 未连接

# Connection_OnlineTitle
source: Agent connected
zh_cn: Agent 已连接

# Connection_StatusTitle
source: Agent connection status
zh_cn: Agent 连接状态

# Connection_ConnectingMessage
source: Connecting to InputFlow Agent…
zh_cn: 正在连接 InputFlow Agent…

# Connection_OnlineMessage
source: The control and event connections are available.
zh_cn: 控制连接和事件连接均可用。

# Connection_ReconnectingMessage
source: The event subscription was interrupted and is reconnecting.
zh_cn: 事件订阅已中断，正在重新连接。

# Connection_OfflineMessage
source: InputFlow Agent is offline. Start the Agent or retry the connection.
zh_cn: InputFlow Agent 已离线。请启动 Agent 或重试连接。

# Authority_ChangedTitle
source: Formal configuration changed
zh_cn: 正式配置已变化

# Authority_ChangedMessage
source: Another client changed the rules. Saving will compare again and ask you to reload or confirm an overwrite.
zh_cn: 另一客户端已经更改规则。保存时会再次比较，并要求重新加载或确认覆盖。

# Status_Suspended
source: paused
zh_cn: 已暂停

# Status_Running
source: running
zh_cn: 运行中

# Status_SummaryFormat
source: phase={0} {1} enabled rules={2} reconciliation={3}
zh_cn: phase={0} {1} 启用规则={2} reconciliation={3}

# Status_WithLastErrorFormat
source: {0} Last error: {1}
zh_cn: {0} 最近错误：{1}

# PauseButton_ResumeAutomationName
source: Resume Agent
zh_cn: 恢复 Agent

# PauseButton_PauseAutomationName
source: Pause Agent
zh_cn: 暂停 Agent

# About_VersionFormat
source: Settings v{0} Agent v{1} process architecture {2} configuration Schema v{3}
zh_cn: Settings v{0} Agent v{1} 进程架构 {2} 配置 Schema v{3}

# Reconnect_FailedTitle
source: Reconnect failed
zh_cn: 重连失败

# ReloadDialog_Title
source: Discard the unsaved draft?
zh_cn: 放弃未保存草稿？

# ReloadDialog_Message
source: Reloading discards unsaved Settings changes and does not modify the Agent.
zh_cn: 重新加载会丢弃当前设置程序中的未保存更改，不会修改 Agent。

# ReloadDialog_DiscardAndReload
source: Discard and reload
zh_cn: 放弃并重新加载

# Reload_CompleteTitle
source: Reload complete
zh_cn: 已重新加载

# Reload_CompleteMessage
source: The draft was reset to the Agent's formal configuration.
zh_cn: 草稿已重置为 Agent 的正式配置。

# Reload_FailedTitle
source: Reload failed
zh_cn: 重新加载失败

# Save_FinishEditingFirst
source: Write the current rule to the draft or cancel the edit before saving the full configuration.
zh_cn: 请先“写入草稿”或取消当前规则编辑，再保存整份配置。

# Save_ExternalChangeTitle
source: Formal rules changed elsewhere
zh_cn: 正式规则已在其他地方改变

# Save_ExternalChangeMessage
source: The formal rules changed in another client. Reload, or explicitly confirm an overwrite. This check is not an atomic concurrency transaction.
zh_cn: 正式规则已在其他客户端改变。可重新加载，或明确确认覆盖；该检查不是原子并发事务。

# Save_ConfirmOverwrite
source: Confirm overwrite
zh_cn: 确认覆盖

# Save_KeepDraft
source: Keep draft
zh_cn: 保留草稿

# Save_CleanupWarningsFormat
source: Cleanup warnings: {0}
zh_cn: 清理警告：{0}

# Save_CompleteTitle
source: Save complete
zh_cn: 保存完成

# Save_IncompleteTitle
source: Save incomplete
zh_cn: 保存未完成

# Save_IncompleteMessageFormat
source: {0} If the request was sent, a timeout does not prove that saving failed. Reconnect and verify.
zh_cn: {0} 若请求已经发出，超时不等于保存失败，请重连核对。

# SaveTitle_ValidationFailed
source: Validation failed
zh_cn: 验证失败

# SaveTitle_PersistenceFailed
source: Persistence failed
zh_cn: 持久化失败

# SaveTitle_RuntimeCancelled
source: Runtime replacement cancelled
zh_cn: 运行时替换已取消

# SaveTitle_RuntimeFailed
source: Runtime replacement failed
zh_cn: 运行时替换失败

# SaveTitle_RuntimeBusy
source: Agent is reconciling a previous request
zh_cn: Agent 正在核对上一请求

# SaveTitle_RolledBack
source: Save rolled back
zh_cn: 保存已回滚

# SaveTitle_RecoveryRequired
source: Restart Agent to recover
zh_cn: 需要重启 Agent 恢复

# SaveTitle_Unknown
source: Save result needs verification
zh_cn: 保存结果待核对

# SaveMessage_Applied
source: The Agent validated, saved, applied, and read back the rules.
zh_cn: 规则已经由 Agent 验证、保存、应用并读回核对。

# SaveMessage_AppliedWithWarnings
source: The rules were applied, but cleanup of old recovery files reported warnings.
zh_cn: 规则已应用，但清理旧恢复文件时有警告。

# SaveMessage_ValidationFailed
source: The Agent rejected the draft. Correct the rules and save again.
zh_cn: Agent 拒绝了草稿，请修正规则后再保存。

# SaveMessage_PersistenceFailed
source: The configuration could not be persisted. The old rules continue running.
zh_cn: 配置无法持久化，旧规则继续运行。

# SaveMessage_RuntimeCancelled
source: Runtime replacement was cancelled before it began. The old rules continue running.
zh_cn: 运行时替换尚未开始且已取消，旧规则继续运行。

# SaveMessage_RuntimeFailed
source: Runtime replacement failed. The draft was preserved.
zh_cn: 运行时替换失败，草稿已保留。

# SaveMessage_RuntimeBusy
source: The Agent is reconciling a previous configuration apply. This draft was not submitted again.
zh_cn: Agent 正在核对上一项配置应用，当前草稿没有再次提交。

# SaveMessage_RolledBack
source: The timed-out runtime replacement failed and the Agent restored the previous formal configuration. The draft remains available.
zh_cn: 先前超时的运行时替换最终失败；Agent 已恢复旧正式配置，当前草稿仍保留。

# SaveMessage_RecoveryRequired
source: The Agent could not determine or recover the runtime result. Restart the Agent, then reload the formal configuration. Do not submit again first.
zh_cn: Agent 无法确定或恢复运行时结果。请重启 Agent 后重新读取正式配置；不要重复提交。

# SaveMessage_Unknown
source: The result cannot be proven applied or rolled back. The draft was preserved; reconnect and verify.
zh_cn: 无法证明结果已应用或已回滚。草稿已保留，请重连核对。

# Runtime_PausedTitle
source: Agent paused
zh_cn: Agent 已暂停

# Runtime_ResumedTitle
source: Agent resumed
zh_cn: Agent 已恢复

# Runtime_ControlConfirmedMessage
source: The Agent confirmed the state. Later tray, F12, and other-client changes will synchronize through events.
zh_cn: 状态已由 Agent 确认；托盘、F12 和其他客户端的后续变化会通过事件同步。

# Runtime_ControlFailedTitle
source: Runtime control failed
zh_cn: 运行控制失败

# Diagnostics_QueryFailedFormat
source: Query failed: {0}
zh_cn: 查询失败：{0}

# Diagnostics_NoSamples
source: no samples
zh_cn: 暂无样本

# Language_RestartTitle
source: Reopen Settings to apply
zh_cn: 重新打开 Settings 后生效

# Language_RestartMessage
source: The preference was saved. Close and reopen Settings to use the selected language. The Agent and active rules keep running.
zh_cn: 偏好已保存。关闭并重新打开 Settings 后将使用所选语言；Agent 和当前规则会继续运行。

# Language_SaveFailedTitle
source: Language preference not saved
zh_cn: 语言偏好未保存

# Language_SaveFailedMessage
source: Settings could not write the per-user UI preference. The current language will remain in effect.
zh_cn: Settings 无法写入当前用户的界面偏好，将继续使用当前语言。

# DeleteDialog_TitleFormat
source: Delete {0} from the draft?
zh_cn: 从草稿删除 {0}？

# DeleteDialog_Message
source: Deletion changes only the local draft. It affects the Agent after you select Validate and save.
zh_cn: 删除只修改本地草稿；点击“验证并保存”后才会影响 Agent。

# RuleValidation_IdRequired
source: Rule ID is required.
zh_cn: 规则 ID 不能为空。

# RuleValidation_TimeoutRange
source: timeout_ms must be from 1 through 60000.
zh_cn: timeout_ms 必须在 1–60000 之间。

# RuleValidation_DirectionRequired
source: Select a mouse direction.
zh_cn: 请选择鼠标方向。

# RuleValidation_ActionKeyRequired
source: The action requires at least one key.
zh_cn: 动作至少需要一个键。

# RuleValidation_DirectionDistanceRange
source: Minimum net displacement must be an integer from 10 through 2000 screen pixels.
zh_cn: 最小净位移必须是 10–2000 的整数屏幕像素。

# RuleValidation_DirectionDurationRange
source: Maximum time window must be an integer from 100 through 5000 milliseconds.
zh_cn: 最大时间窗必须是 100–5000 的整数毫秒。

# RuleValidation_DirectionToleranceRange
source: Off-axis tolerance must be an integer from 0 through 2000 screen pixels.
zh_cn: 偏轴容差必须是 0–2000 的整数屏幕像素。

# Preview_DefaultMessage
source: The preview does not save pointer paths or run actions. Starting it acts as a temporary activation.
zh_cn: 预览不保存轨迹，也不执行动作；点击开始相当于临时激活。

source: Preview stopped.
zh_cn: 预览已停止。

# Preview_CancelledShort
source: Preview cancelled.
zh_cn: 预览已取消。

# Preview_ConnectionLost
source: The Agent connection was lost; direction preview was cancelled.
zh_cn: Agent 连接已断开；方向预览已取消。

# Preview_CaptureActive
source: Input capture is active. Cancel capture before starting direction preview.
zh_cn: 输入录制进行中；请先取消录制再开始方向预览。

# Preview_ParametersIncomplete
source: Direction preview parameters are incomplete.
zh_cn: 方向预览参数不完整。

# Preview_CursorUnavailable
source: The current pointer screen coordinates could not be read, so preview did not start.
zh_cn: 无法读取当前光标屏幕坐标，方向预览没有开始。

# Preview_StartedFormat
source: Preview started at ({0}, {1}). You do not need to hold the activation key; this button replaces temporary activation for up to {2} ms.
zh_cn: 预览已开始：起点 ({0}, {1})。无需按激活键；本按钮只替代本次临时激活，最多 {2} ms。

# Preview_Cancelled
source: Preview cancelled. No pointer path was saved and no action ran.
zh_cn: 预览已取消；未保存坐标轨迹，也未执行动作。

# Preview_TimedOut
source: The preview time window ended without a match or action.
zh_cn: 预览时间窗已结束；未命中且未执行动作。

# Preview_CursorReadFailed
source: Reading the pointer position failed; preview stopped safely.
zh_cn: 读取光标位置失败；预览已安全停止。

# Preview_AxisEqualFormat
source: Net displacement dx={0}, dy={1} px; the axes are equal, so direction is not determined.
zh_cn: 净位移 dx={0}, dy={1} px；主轴相等，方向尚未确定。

# Preview_ProgressFormat
source: Direction {0}; net displacement dx={1}, dy={2} px; primary axis {3} px, off-axis {4} px.
zh_cn: 方向 {0}；净位移 dx={1}, dy={2} px；主轴 {3} px，偏轴 {4} px。

# Preview_MatchedFormat
source: Preview matched {0}. This is only a summary; no action ran.
zh_cn: 预览命中 {0}；这里只显示摘要，不执行动作。

# Preview_StoppedForCapture
source: Direction preview stopped while input capture starts.
zh_cn: 方向预览已停止，正在录制输入。

# Preview_EscapeCancelled
source: Esc cancelled the preview. No pointer path was saved and no action ran.
zh_cn: 预览已由 Esc 取消；未保存坐标轨迹，也未执行动作。

# Direction_Left
source: Left
zh_cn: 左

# Direction_Right
source: Right
zh_cn: 右

# Direction_Up
source: Up
zh_cn: 上

# Direction_Down
source: Down
zh_cn: 下

# MouseButton_Left
source: Left
zh_cn: 左键

# MouseButton_Right
source: Right
zh_cn: 右键

# MouseButton_Middle
source: Middle
zh_cn: 中键

# MouseButton_XButton1
source: Extra button 1
zh_cn: 扩展按钮 1

# MouseButton_XButton2
source: Extra button 2
zh_cn: 扩展按钮 2

# ActionKey_RemoveAutomationName
source: Remove this action key
zh_cn: 移除此动作键

# Capture_StartingTitle
source: Starting input capture
zh_cn: 正在启动录制

# Capture_StartingMessage
source: Press one input. Each capture fills only the current field; Esc cancels without writing to the draft.
zh_cn: 请按下一个输入。一次录制只填写当前字段；Esc 取消且不会写入草稿。

# Capture_CancelledTitle
source: Capture cancelled
zh_cn: 录制已取消

# Capture_StartFailedTitle
source: Could not start capture
zh_cn: 无法开始录制

# Capture_CancelledBeforeStartMessage
source: The cancellation request took effect. No input will be written to the field.
zh_cn: 取消意图已生效，没有输入会写入字段。

# Capture_CountdownFormat
source: Capturing input ({0} seconds remaining)
zh_cn: 正在录制输入（剩余 {0} 秒）

# Capture_EscapeReservedMessage
source: Esc is reserved for cancelling capture. To configure Escape, use the selector.
zh_cn: Esc 保留为录制取消键；如需配置 Escape，请使用选择器。
